# apps
brew "mas"
brew "emacs"
brew "gnuplot"
brew "sqlite"
brew "tmux"
brew "pymol"
brew "openjdk"
brew "spaceman" # https://github.com/Jaysce/Spaceman

# commands
brew "exa"         # ls
brew "iproute2mac" # ip 
brew "nkf"        # 文字コード
brew "inetutils"
brew "imagemagick"
brew "youtube-dl"
brew "jq"
brew "git-lfs"
brew "ffmpeg"
brew "hub"     #githubの上級コマンド
cask "macfuse" # needed for sshfs. should be installed before ssfs-mac
brew "gromgit/fuse/sshfs-mac" #original sshfs is deprecated in brew. see https://blog.kmdkuk.com/2021/06/05/macでsshfsをインストール.html 
brew "pyenv" # https://mitsudo.net/python環境の構築-mac-with-anaconda-by-homebrew/
brew "pyenv-virtualenv"
brew "asymptote"
brew "aspell"
brew "tree"

# update command
brew "bash"    #ブレース展開にbash4以上が必要．

# chemical
brew "open-babel"

# gnu command replace
# https://qiita.com/eumesy/items/3bb39fc783c8d4863c5f
# https://yu8mada.com/2018/07/25/install-gnu-commands-on-macos-with-homebrew/
#brew "coreutils --default-names"
brew "coreutils"  #色付けにgnu lsが必要
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gsed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "gnutls"
brew "wdiff"
brew "wget"
brew "gnu-which"


# other highlevel command replace
# https://fhiyo.github.io/2017/11/14/colorize-terminal-output.html
brew "ccat" # replace cat
brew "grc"  # ping, etc..
brew "colordiff" # replace diff
brew "source-highlight" # replace less



# cask font
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
brew "ricty"
cask "font-ricty-diminished"

# cask
# cask "anaconda" 現在M1macに非対応
cask "xquartz" # need password
cask "thorium" # epub reader
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "alfred"
cask "notion"
cask "keepassXC"
cask "visual-studio-code"
cask "zotero"
cask "slack"
cask "skim"
cask "deepl"
cask "dropbox"
cask "grammarly"
cask "itsycal"
cask "sourcetree" #github GUI
cask "db-browser-for-sqlite"
cask "gpg-suite-no-mail" # needed for opengpg need password
cask "background-music" #need password. not suitable for M1 mac
cask "google-drive" #need password
cask "zoom"  #need password
cask "zerotier-one"


# cask for Lab
cask "apache-directory-studio"
cask "nextcloud" # need password


# chemical
cask "ibabel"
cask "avogadro"

# Finder extension
cask "openinterminal-lite"
cask "openineditor-lite"


# appstore
mas "Things 3", id: 904280696
mas "WeatherBug", id: 1059074180
# mas "hidden bard", id: 1452453066
# mas "Line", id: 539883307
mas "Adblock Plus", id: 1432731683
mas "CopyClip", id: 595191960
mas "DaVinci Resolve", id: 571213070
mas "Disk Speed Test", id: 425264550
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "GetRate", id: 1085850238
mas "iMage Tools", id: 493949693
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "Journey", id: 1300202543
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MarginNote 3", id: 1423522373
mas "MARKETSPEED", id: 946680495
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Vimari", id: 1480933944
mas "WeatherBug", id: 1059074180
mas "WhatFont", id: 1437138382
mas "Xcode", id: 497799835
mas "デスクトップ時計", id: 894760156


# after things3 install
cask "thingsmacsandboxhelper"
